#!/bin/sh

# ==============================================================================
#   機能
#     ・引数に指定されたコマンドラインを表示・実行する(CMD_V)
#   構文
#     . cmd_v_function.sh
#     CMD_V "CMD_LINE"
#
#   Copyright (c) 2004-2017 Yukio Shiiya
#
#   This software is released under the MIT License.
#   https://opensource.org/licenses/MIT
# ==============================================================================

######################################################################
# 関数定義
######################################################################
# コマンドラインの表示・実行
CMD_V() {
	(eval "set -x; $*")
	return
}
