#!/bin/sh

# ==============================================================================
#   機能
#     第1引数に指定された文字列がドメイン名の規則に従っているか否かをチェックする
#   構文
#     . is_domainname_function.sh
#     IS_DOMAINNAME "STR"
#
#   Copyright (c) 2004-2017 Yukio Shiiya
#
#   This software is released under the MIT License.
#   https://opensource.org/licenses/MIT
# ==============================================================================

######################################################################
# 関数定義
######################################################################
# 指定された文字列がドメイン名か否かのチェック
IS_DOMAINNAME() {
	# 引数のチェック
	if [ $# -ne 1 ];then
		return 1
	fi
	str=$1

	# 指定された文字列がドメイン名か否かのチェック
	set -- `echo ${str} | sed 's/\./ /g'`

	for i in $*
	do
		# O'REILLY「DNS & BIND 改訂版」4.5章より引用
		#   ・ホスト名の各ラベルでは、英数字のみを使用できる。
		#   ・ラベルの途中であれば、ハイフン("-")も使用できる。
		#   ・ホスト名ではアンダスコア("_")は使用できない。
		echo ${i} | grep -q -e '^[0-9a-zA-Z][0-9a-zA-Z-]*$'
		if [ $? -ne 0 ];then
			return 1
		fi
	done

	return 0
}

